app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT * FROM `documents`

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)

  def create
    @document = Document.new(params[:document])
    if @document.save
---
INSERT INTO `documents` (`created_at`, `title`, `pdf_file_size`, `updated_at`, `pdf_content_type`, `pdf_file_name`, `pdf_updated_at`, `content`) VALUES('2011-03-24 14:55:03', 'Fatura', 381229, '2011-03-24 14:55:03', 'application/pdf', '815816285_22-09-2010.pdf', '2011-03-24 14:55:01', NULL)

  def edit
    @document = Document.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 3)

  def update
    @document = Document.find(params[:id])
    if @document.update_attributes(params[:document])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 3)
UPDATE `documents` SET `pdf_file_name` = 'Impressão de Cupom - 55%OFF em 1h de Boliche + Torre de Chopp Brahma + Batata Frita Especial 700g no Snow Bowling(de R$89,9 por R$39,9) - Tiago Paulino.pdf', `pdf_file_size` = 150847, `pdf_updated_at` = '2011-03-23 14:52:55', `updated_at` = '2011-03-23 14:52:58' WHERE `id` = 3

  def destroy
    @document = Document.find(params[:id])
    @document.destroy
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
DELETE FROM `documents` WHERE `id` = 1